Tekla Open API Reference for Tekla Structures 2025
Edge Class
 The Edge class represents a single global edge in a solid.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Solid.Edge
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class Edge : ICloneable
Public NotInheritable Class Edge
	Implements ICloneable
The Edge type exposes the following members.
Properties
Name | Description
EndPoint
 Gets the end point of the edge.
StartPoint
 Gets the start point of the edge.
Type
 Gets the type of the edge.
Top
Methods
Name | Description
Clone
 Method for cloning the current object.
Top
See Also
Reference
Tekla.Structures.Solid Namespace